{
  "name": "Asaro Kideki",
  "About me": "About me",
  "Education": "Education",
  "Skills": "Skills",
  "Work Histories": "Work Histories",
  "CV": "CV",
  "Kita Osaka | Toyonaka": "Kita Osaka | Toyonaka",
  "Senda Japan | Tokyo | Remote": "Senda Japan | Tokyo | Remote",
  "Jun": "Jun",
  "Feb": "Feb",
  "Apr": "Apr",
  "Mar": "Mar",
  "May, 2018 - Feb, 2022": "May, 2018 - Feb, 2022",
  "Feb, 2022 - Jun, 2025": "Feb, 2022 - Jun, 2025",
  "summary1": "I developed a responsive and user-friendly e-commerce front- end using React.js, Tailwind CSS, and Redux. I implemented key features such as dynamic product catalogs,secure user authentication, and a smooth checkout process, ensuring optimal performance through lazy loading and asset optimization. I also integrated RESTful APIs for seamless data fetching and ensured cross - browser compatibility with thorough testing.",
  "summary2": "I created a responsive e-commerce platform using Next.js and Tailwind CSS enhanced with Hooks functions for state management. Key achievements include implementing a dynamic product catalog, strong user authentication and a streamlined payment process, optimizing performance with lazy loading and efficient API integration, and rigorous testing to ensure smooth functionality across a variety of browsers.",
  "summary3": "My responsibility in the Vodafone project was to handle both frontend and backend.On the front end, the user interface was designed using HTML, CSS, and JavaScript frameworks, TypeScript such as React.js or Angular to ensure responsiveness and cross- browser compatibility.On the back end, server - side logic was written in languages ​​such as Node.js or Python.We built and managed the database, developed APIs for seamless data integration, and also handled deployment, testing, and maintenance using tools such as Git for version control and cloud platforms for hosting. This holistic approach enables end - to - end development of powerful, scalable web solutions.",
  "summary4": "100 Tokyo is a curated cultural guide that showcases the most fascinating and unique aspects of Japan's capital city. Based on research conducted among Tokyo residents, we carefully selected places that inspire us in design, fashion, technology, art, food, architecture and tourism, creating a new way to perceive the city and a vibrant, modern city that is evolving at every moment, creating a Tokyo trip filled with creativity and excitement.",
  "summary5": "The purpose of developing the Rent Car booking website is to provide users with an easy and efficient platform to browse, compare, and book rental cars online. It simplifies the booking process, offering a wide selection of vehicles, transparent pricing, and secure transactions, all designed to enhance the user's rental experience.",
  "summary6": "The “K & K” in K & K Heart School stands for “Nursing and Care” or “Mind and Body” and symbolizes our commitment to nurturing both knowledge and heart. The site’s goal was to support those studying nursing and care by providing an education that goes beyond the exam and imparting lifelong values ​​and compassion, while sharing the principles of friendship and fostering connection that underpin our educational philosophy. The project used YouTube, Site Kit, RSS, and Open Graph to improve both the user experience and site performance. YouTube integration made it easy to embed videos and expand audience reach, while Site Kit provided insights directly on the website from Google tools like Analytics and Search Console, RSS feeds allowed users to subscribe to content updates to stay informed, and Open Graph optimized the sharing of content on social media to improve visibility and engagement.",
  "summary7": "Makutahari Bay Park is a hospital that is open on Sundays and has a large children’s area, making it convenient for parents with children to visit. The site has a unique design and attractive structure, and the front-end and back-end aspects are very cleanly developed, making it very user-friendly. The site also integrates Google Maps into the website, which provides several benefits, including accurate and up-to-date geographic data, customization options, and seamless integration with other Google services. The friendly interface, real-time data, and global reach enhance user trust and experience, while improving local search visibility, giving businesses an SEO advantage.",
  "summary8": "The Zoff online store is designed to provide a seamless shopping experience featuring easy navigation, secure payment options, and a wide range of products with fast shipping. With a focus on user-friendliness, the site is optimized for both desktop and mobile, allowing customers to shop from anywhere. This project used GSAP, Google Tag Manager, and Nginx to improve performance, analytics, and user engagement. GSAP was used to provide smooth and efficient animations to improve the user experience. Google Tag Manager was used to simplify the management of tracking codes and marketing tags without changing the site code. Nginx was also used to provide high-performance web serving and load balancing to ensure fast and reliable website delivery.",
  "Senior Full Stack Developer": "Senior Full Stack Developer",
  "Junior Full Stack Developer": "Junior Full Stack Developer",
  "Front-End Development": "Front-End Development",
  "Full-Stack Development": "Full-Stack Development",
  "Careful Mail Order": "Careful Mail Order",
  "HAKU Takatsuki store": "HAKU Takatsuki store",
  "Vodafone": "Vodafone",
  "100 Tokyo": "100 Tokyo",
  "Hako Rental Car": "Hako Rental Car",
  "K&K&H&School": "K&K&H&School",
  "Makuhari Bay Park": "Makuhari Bay Park",
  "Zoff": "Zoff",
  "Email": "Email",
  "Phone": "Phone",
  "About me content": "I have worked in web development for nearly 6 years as a Full Stack Developer. I've always had a love for building the design so taking the initiative to learn Front-End Web Development has definitely been one of the most challenging yet amazing decisions I've ever made. Contributing to web development projects and overcoming both personal and professional challenges have only further motivated me to continue pursuing my career goals within the software development industry This journey has also taught me to believe and be kind to myself, anything is possible with time and dedication. I can't wait to see where this road take me and I wouldn't have it any other way! When I'm not on the job, I love hiking with my dog, working my way through every recipe in the family cookbook, and indulging my love for seeing new places.",
  "University": "Kansai University",
  "Degree": "Bachelor’s Degree in Computer Science",
  "Education content": "I studied at Kansai University for 4 years. The 4 years I spent in University were truly happy days and unforgettable memories of my life. I met some of the best teachers and truest friends of my life there. Also, I was able to learn software engineering, which was my dream, to my heart's content. I studied hard and graduated with a master's degree in software engineering.",
  "Tech Stack": "Tech Stack",
  "Skill content": "I have worked with many frontend frameworks and the following skills are ones I have over 5 years of experience with. With these skills, I have implemented the frontend development of modern websites perfectly.",
  "Work Experience": "Work Experience",
  "Project Title": "Project Title",
  "Project Role": "Project Role",
  "Cancel": "Cancel",
  "Visit Website": "Visit Website"
}