{
  "name": "アサロキデキ",
  "About me": "私について",
  "Education": "教育",
  "Skills": "スキル",
  "Work Histories": "職歴",
  "CV": "履歴書",
  "Kita Osaka | Toyonaka": "北大阪 | 豊中",
  "Senda Japan | Tokyo | Remote": "千田ジャパン | 東京 | リモート",
  "Jun": "1月",
  "Feb": "2月",
  "Apr": "4月",
  "Mar": "5月",
  "May, 2018 - Feb, 2022": "5月, 2018 - 2月, 2022",
  "Feb, 2022 - Jun, 2025": "2月, 2022 - 1月, 2025",
  "summary1": "私は、React.js、Tailwind CSS、Redux を使用して、レスポンシブでユーザーフレンドリーな e コマース フロントエンドを開発しました。動的な製品カタログ、安全なユーザー認証、スムーズなチェックアウト プロセスなどの主要機能を実装し、遅延読み込みとアセットの最適化によって最適なパフォーマンスを確保しました。また、シームレスなデータ取得のために RESTful API を統合し、徹底的なテストでクロスブラウザーの互換性を確保しました。",
  "summary2": "私は、状態管理用のフック関数で強化された Next.js と Tailwind CSS を使用して、レスポンシブな e コマース プラットフォームを作成しました。主な成果としては、動的な製品カタログ、強力なユーザー認証、合理化された支払いプロセスの実装、遅延読み込みと効率的な API 統合によるパフォーマンスの最適化、さまざまなブラウザーでスムーズに機能することを保証するための厳格なテストなどがあります。",
  "summary3": "Vodafone プロジェクトでの私の責任は、フロントエンドとバックエンドの両方を担当することでした。フロントエンドでは、応答性とクロスブラウザ互換性を確保するために、HTML、CSS、JavaScript フレームワーク、React.js や Angular などの TypeScript を使用してユーザーインターフェイスが設計されました。バックエンドでは、サーバーサイドのロジックが Node.js や Python などの言語で記述されました。データベースを構築して管理し、シームレスなデータ統合のための API を開発し、バージョン管理用の Git やホスティング用のクラウドプラットフォームなどのツールを使用して、展開、テスト、メンテナンスも担当しました。この総合的なアプローチにより、強力でスケーラブルな Web ソリューションのエンドツーエンドの開発が可能になります。",
  "summary4": "100 東京は、日本の首都の最も魅力的でユニークな側面を紹介する、厳選された文化ガイドです。東京の住民を対象に実施した調査に基づいて、デザイン、ファッション、テクノロジー、アート、食べ物、建築、観光の面でインスピレーションを与えてくれる場所を慎重に選び、東京の新しい見方と、常に進化している活気に満ちた近代的な都市を創り出し、創造性と興奮に満ちた東京旅行を創り上げます。",
  "summary5": "レンタカー予約ウェブサイトの開発目的は、レンタカーをオンラインで閲覧、比較、予約するための簡単で効率的なプラットフォームをユーザーに提供することです。予約プロセスを簡素化し、幅広い車種、透明性のある価格設定、安全な取引を提供し、ユーザーのレンタル体験を向上させるように設計されています。",
  "summary6": "K＆Kハートスクールの「K＆K」は「看護とケア」または「心と体」の略で、知識と心の両方を育むという私たちの取り組みを象徴しています。このサイトの目標は、看護とケアを学ぶ人々を支援するために、試験を超えた教育を提供し、生涯にわたる価値観と思いやりを伝え、私たちの教育理念の根底にある友情とつながりの促進の原則を共有することでした。このプロジェクトでは、YouTube、Site Kit、RSS、Open Graphを使用して、ユーザーエクスペリエンスとサイトパフォーマンスの両方を改善しました。YouTubeの統合により、動画の埋め込みと視聴者のリーチの拡大が容易になり、Site KitはアナリティクスやSearch ConsoleなどのGoogleツールからWebサイトに直接分析情報を提供し、RSSフィードによりユーザーはコンテンツの更新を購読して最新情報を入手でき、Open Graphはソーシャルメディアでのコンテンツの共有を最適化して可視性とエンゲージメントを向上させました。",
  "summary7": "マクタハリ ベイ パークは日曜日も開いている病院で、広いキッズ エリアがあり、子供連れの親にとって便利な場所です。このサイトはユニークなデザインと魅力的な構造を備え、フロントエンドとバックエンドの側面が非常にきれいに開発されているため、非常にユーザー フレンドリーです。また、このサイトには Google マップが統合されており、正確で最新の地理データ、カスタマイズ オプション、他の Google サービスとのシームレスな統合など、さまざまなメリットがあります。使いやすいインターフェイス、リアルタイム データ、グローバルなリーチにより、ユーザーの信頼とエクスペリエンスが向上し、ローカル検索の可視性が向上し、ビジネスに SEO の優位性がもたらされます。",
  "summary8": "Zoff オンライン ストアは、簡単なナビゲーション、安全な支払いオプション、幅広い製品と迅速な配送を特徴とするシームレスなショッピング体験を提供するように設計されています。ユーザー フレンドリーさを重視したこのサイトは、デスクトップとモバイルの両方に最適化されており、顧客はどこからでも買い物ができます。このプロジェクトでは、GSAP、Google タグ マネージャー、Nginx を使用して、パフォーマンス、分析、ユーザー エンゲージメントを改善しました。GSAP は、ユーザー エクスペリエンスを向上させるために、スムーズで効率的なアニメーションを提供するために使用されました。Google タグ マネージャーは、サイト コードを変更せずにトラッキング コードとマーケティング タグの管理を簡素化するために使用されました。また、Nginx を使用して、高速で信頼性の高い Web サイト配信を保証するために、高性能の Web サービスと負荷分散を提供しました。",
  "Senior Full Stack Developer": "シニアフルスタック開発者",
  "Junior Full Stack Developer": "ジュニアフルスタック開発者",
  "Front-End Development": "フロントエンド開発",
  "Full-Stack Development": "フルスタック開発",
  "Careful Mail Order": "慎重な通信販売",
  "HAKU Takatsuki store": "HAKU高月店",
  "Vodafone": "ボーダフォン",
  "100 Tokyo": "100 東京",
  "Hako Rental Car": "ハコレンタカー",
  "K&K&H&School": "K&K&H&スクール",
  "Makuhari Bay Park": "幕張ベイパーク",
  "Zoff": "ゾフ",
  "Email": "メール",
  "Phone": "電話",
  "About me content": "私はフルスタック開発者として、約 6 年間 Web 開発に携わってきました。私は常にデザインを構築するのが好きだったので、フロントエンド Web 開発を学ぶという自発的な決断は、間違いなくこれまでで最も困難でありながら素晴らしい決断の 1 つでした。Web 開発プロジェクトに貢献し、個人的および職業上の課題を克服したことで、ソフトウェア開発業界でのキャリア目標を追求し続けるモチベーションがさらに高まりました。この旅で、時間と献身があれば何でも可能だと信じ、自分に優しくすることも学びました。この道が私をどこへ連れて行ってくれるのか楽しみでなりません。他の方法は考えられません。仕事をしていないときは、愛犬と一緒にハイキングをしたり、家族の料理本にあるすべてのレシピを試したり、新しい場所を見るのが大好きです。",
  "University": "関西大学",
  "Degree": "コンピュータサイエンス学士号",
  "Education content": "私は関西大学で4年間学びました。大学で過ごした4年間は本当に幸せな日々であり、人生で忘れられない思い出です。そこで私は人生で最高の先生や最高の友達に出会いました。また、私の夢であったソフトウェアエンジニアリングを心ゆくまで学ぶことができました。一生懸命勉強し、ソフトウェアエンジニアリングの修士号を取得して卒業しました。",
  "Tech Stack": "技術スタック",
  "Skill content": "私は多くのフロントエンド フレームワークに携わっており、以下のスキルは 5 年以上の経験があります。これらのスキルを使用して、最新の Web サイトのフロントエンド開発を完璧に実装しました。",
  "Work Experience": "実務経験",
  "Project Title": "プロジェクト名",
  "Project Role": "プロジェクトの役割",
  "Cancel": "キャンセル",
  "Visit Website": "ウェブサイトを訪問"
}